app/controllers/phone_numbers_controller.rb

SELECT * FROM "phone_numbers"
---
  def index
    @phone_numbers = PhoneNumber.all

SELECT * FROM "phone_numbers" WHERE ("phone_numbers"."id" = 298486374)
---
  def show
    @phone_number = PhoneNumber.find(params[:id])

INSERT INTO "phone_numbers" ("number", "created_at", "updated_at", "person_id") VALUES(NULL, '2010-09-23 18:29:07', '2010-09-23 18:29:07', NULL)
---
  def create
    @phone_number = PhoneNumber.new(params[:phone_number])
    if @phone_number.save

SELECT * FROM "phone_numbers" WHERE ("phone_numbers"."id" = 298486374)
---
  def edit
    @phone_number = PhoneNumber.find(params[:id])

SELECT * FROM "phone_numbers" WHERE ("phone_numbers"."id" = 298486374)
---
  def update
    @phone_number = PhoneNumber.find(params[:id])

SELECT * FROM "phone_numbers" WHERE ("phone_numbers"."id" = 298486374)
DELETE FROM "phone_numbers" WHERE "id" = 298486374
---
  def destroy
    @phone_number = PhoneNumber.find(params[:id])
    @phone_number.destroy